//=============================================================
// Renderer.h
// レンダラークラスの定義
//=============================================================

#ifndef _Renderer_h_
#define _Renderer_h_

#include "dx9sdk\Include\d3d9.h"
#include "dx9sdk\Include\d3dx9.h"
#include "Common.h"
#include "Sound.h"
#include "Texture.h"
#include "Text.h"
#include "GM_AdvText.h"
#include "Variable.h"

//=============================================================
// 依存するクラス
//=============================================================
class Scene;

//=============================================================
// Renderer
// レンダラークラス
//=============================================================
class Renderer
{
public:
	//---------------------------------------------------------
	// デフォルトコンストラクタ
	//---------------------------------------------------------
	Renderer();

	//---------------------------------------------------------
	// デストラクタ
	//---------------------------------------------------------
	~Renderer();

public:
	//---------------------------------------------------------
	// レンダラーの初期化
	// 引数
	//		hWnd         : ウィンドウハンドル
	//		isFullScreen : フルスクリーンの場合TRUE
	//		clientWidth  : クライアント領域の幅
	//		clientHeight : クライアント領域の高さ
	// 戻り値
	//		成功したらS_OK 
	//---------------------------------------------------------
	HRESULT Initialize(HWND hWnd, BOOL isFullScreen, int clientWidth, int clientHeight);

	//---------------------------------------------------------
	// デバイスの取得
	// 戻り値
	//		成功したらIDirect3DDevice9インターフェイスへのポインタ
	//		失敗したら0
	//---------------------------------------------------------
	LPDIRECT3DDEVICE9 GetDevice();


	//---------------------------------------------------------
	// デバイスの取得
	// 戻り値
	//		成功したらIDirect3DDevice9インターフェイスへのポインタ
	//		失敗したら0
	//---------------------------------------------------------
	LPDIRECT3D9 GetInterface();

	//---------------------------------------------------------
	// シーンの描画
	// 引数
	//		pScene : シーンへのポインタ
	// 戻り値
	//		成功したらS_OK 
	//---------------------------------------------------------
	void RenderScene(Scene* pScene);

	//---------------------------------------------------------
	//メインルーチン関数
	//---------------------------------------------------------
	 int Mainroutine(void);
	//---------------------------------------------------------
	// 終了処理
	//---------------------------------------------------------
	void Finalize();
	HWND* AddressHWND(HWND *hwnd_dist)
	{
		if(hwnd!=0)
		{
			hwnd=hwnd_dist;
			return 0;
		}
		else
		{
			return hwnd;
		}
	}

private:
	LPDIRECT3D9				m_pD3D;			// IDirect3D9インターフェイスへのポインタ
	LPDIRECT3DDEVICE9		m_pD3DDevice;	// IDirect3DDevice9インターフェイスへのポインタ
	D3DPRESENT_PARAMETERS	m_D3DPP;		// デバイスのプレゼンテーションパラメータ
	Ctext					adv_text;//テキスト描写関係
	Ctexture				texture;//テクスチャ描写関係
	Csound					sound;
	CBlockText				btext;
	CVariable				variable;

	CADV					adv;
	HWND					*hwnd;


};

#endif //_Renderer_h_